{
  "pl": {
    "contact": "Kontakt",
    "changeTheme": "Zmień motyw: ciemny",
    "changeLanguageLabel": "Zmień język:",
    "polish": "Polski",
    "english": "English",
    "home": "O mnie",
    "skills": "Umiejętności",
    "projects": "Projekty",
    "interests": "Zainteresowania",
    "contactTitle": "Kontakt",
    "phone": "Telefon",
    "email": "Mail",
    "linkedin": "LinkedIn",
    "formTitle": "Możesz również wysłać wiadomość bezpośrednio z mojej strony:",
    "yourName": "Twoje imię:",
    "yourNamePlaceholder": "Wpisz swoje imię",
    "yourEmail": "Twój Email:",
    "yourEmailPlaceholder": "Wpisz swój email",
    "yourMessage": "Wiadomość:",
    "yourMessagePlaceholder": "Napisz swoją wiadomość...",
    "sendMessage": "Wyślij",
    "hello": "Cześć, jestem Kasia",
    "programming": "Wielka pasjonatka programowania od dwóch lat. Absolwentka akademii GoIT, gdzie nabyłam szeroki zakres umiejętności z zakresu Frontendu, jak i Backendu. Nabyte przeze mnie umiejętności możesz zobaczyć <a href='./skills.html'>tutaj</a>.",
    "portfolio": "W swoim portfolio posiadam kilka projektów, zarówno tych indywidualnych, ale i grupowych. <a href='./projects.html'>Tu</a> znajdziesz do linki do stron i kodu.",
    "anotherInterests": "Na co dzień zajmuję się nie tylko programowaniem. Mam kilka innych zainteresowań, którym poświęcam wolny czas. Jeśli chcesz dowiedzieć się więcej o mnie to zapraszam Cię do tej <a href='./interests.html'>zakładki</a>.",
    "areYouInterested": "Spodobała Ci się strona? Projekty? Jesteś zainteresowany współpracą? Zapraszam do  <a href='./contact.html'>kontaktu</a>.",
    "allRights": "&copy; 2025 [Katarzyna]. Wszelkie prawa zastrzeżone.",
    "started": "Od dwóch lat interesuję się programowaniem. Ukończyłam prawie roczny kurs programowania i posiadam certyfikat Fullstack Developera. W trakcie nauki zdobyłam praktyczną wiedzę z zakresu Frontendu i Backendu.",
    "mySkills": "Moje Umiejętności:",
    "html": "Język znaczników. Buduje szkielet strony internetowej.",
    "css": "Język stylów. Pozwala na pozycjonowanie i wygląd poszczególnych elementów strony/aplikacji.",
    "javascript": "Język programowania. Pozwala na wchodzenie w interakcję z poszczególnymi elementami strony.",
    "react": "Biblioteka Javascript. Używa się go do budowy aplikacji webowych.",
    "redux": "Biblioteka Javascript. Służy do zarządzania stanem aplikacji. Używa się jej najczęściej razem z Reactem, ale może być używana z innymi bibliotekami/frameworkami.",
    "node": "Środowisko uruchomieniowe Javascript. Pozwala na wykonywanie kodu poza przeglądarką (na serwerze) i tworzenie aplikacji serwerowych/skryptów/narzędzi.",
    "mongoDb": "Baza danych NoSQL.Cechuje się wysoką wydajnością, skalowalnością i elastycznością, co pozwala na budowę nowoczesnych aplikacji internetowych, mobilnych i analitycznych.",
    "npm": "Node Package Manager. Jest to menadżer pakietów dla Node.js. Pozwala na instalowanie, zarządzanie i udostępnianie paczek Javascript, które mogą być używane w projektach.",
    "git": "System kontroli wersji. Umożliwia śledzenie zmian w kodzie źródłowym i zarządzanie nimi. Używany jest głównie do pracy nad projektami zespołowymi i zarządzania historią zmian w kodzie.",
    "oop": "Object-Oriented Programming. Organizuje program wokół obiektów (instancji klas), co pozwala na ponowne wykorzystanie kodu, a także jego rozszerzanie i utrzymywanie.",
    "rwd": "Responsive Web Design. Pozwala na dopasowanie i poprawne wyświetlenie strony lub plikacji na różnych urządzeniach i rozdzielczościach.",
    "projectIntroduction": "Tutaj znajduje kilka moich projektów, nad którymi pracowałam. Oczywiście to nie koniec i z czasem pojawią się nowe..",
    "details": "Sprawdź szczegóły projektu!",
    "technologiesUsed": "Wykorzystane technologie:",
    "codeLink": "<a href=\"https://github.com/KasiaKaz14/goit-js-hw-11\">Link do kodu</a>",
    "nexinoWebsite": "Strona firmy Nexino Labs",
    "website": "<a href=\"https://nexino-lab.netlify.app\">Strona</a>",
    "programmingServices": "Usługi programistyczne",
    "calendar": "Kalendarz",
    "calendarLink": "<a href=\"https://kasiakaz14.github.io/Calendar-scheduler\">Kalendarz</a>",
    "phonebook": "Książka telefoniczna",
    "phonebookLink": "<a href=\"https://kasiakaz14.github.io/goit-react-hw-08-phonebook\">Książka telefoniczna</a>",
    "imgFinder": "Wyszukiwarka obrazów - React",
    "imgFinderLink": "<ahref=\"https://kasiakaz14.github.io/goit-react-hw-03-image-finder\">Image Finder - React</a>",
    "filmSuggestions": "Propozycje najnowszych filmów",
    "movies": "<a href=\"https://kasiakaz14.github.io/goit-react-hw-05-movies\">Movies</a>",
    "imgFinderJs": "Wyszukiwarka obrazów - JavaScript",
    "imgFinderJsLink": "<a href=\"https://kasiakaz14.github.io/goit-js-hw-11\">Wyszukiwarka obrazów - JavaScript</a>",
    "interestInfo": "Moja pasja to nie tylko programowanie, ale również sport, książki, czy języki obce.",
    "football": "Piłka nożna",
    "footballDetails": "Jest to moja miłość w zasadzie od momentu, kiedy nauczyłam się chodzić. Zawsze byłam bardzo aktywnym dzieckiem, które całe dnie spędzało na dworze, uganiając się za piłką.\nJako starsza dziewczynka wielokrotnie brałam udział w zawodach sportowych, a obecnie jestem zawodniczką II-ligowego zespołu, gdzie gram jako skrzydłowa/wahadłowa.\nTrenuję dwa razy w tygodniu w klubie, a do tego 3-4 razy indywidualnie.\nTen okrągły przedmiot towarzyszy mi już jakieś 25 lat i licznik dalej bije! ;)",
    "books": "Książki",
    "booksDetails": "Kolejny element, bez którego nie umiem funkcjonować na co dzień. Czytam średnio przez około pół godziny dziennie. Jestem wielką fanką kryminałów, ale czytam też chętnie biografie sportowe czy książki związane z mitologią słowiańską, wliczając w to powieści. Najchętniej wybieram kryminały Katarzyny Puzyńskiej, Wojciecha Chmielarza i Remigiusza Mroza, choć bardzo lubię też serię o Jacku Reacherze autora Lee Childa. Nie mogłabym nie wspomnieć o Annie Kańtoch, która wplata w swoje książki elementy fantastyki i tajemnice z przeszłości. Jej książki czyta się jednym tchem.",
    "foreignLanguages": "Języki obce",
    "foreignLanguagesDetails": "To temat, który też zawsze mnie fascynował. W szkole miałam możliwość uczenia się angielskiego i rosyjskiego, którymi posługuję się kolejno na poziomach C1 i B1. Zawsze też miałam marzenie nauczyć się niemieckiego, więc staram się co i raz przyswajać nowe zdania. Mogę się pochwalić, że już trochę rozumiem :)"
  },
  "en": {
    "contact": "Contact",
    "changeTheme": "Change theme: dark",
    "changeLanguageLabel": "Change language:",
    "polish": "Polish",
    "english": "English",
    "home": "About me",
    "skills": "Skills",
    "projects": "Projects",
    "interests": "Interests",
    "contactTitle": "Contact",
    "phone": "Phone",
    "email": "Email",
    "linkedin": "LinkedIn",
    "formTitle": "You can also send a message directly from my page:",
    "yourName": "Your Name:",
    "yourNamePlaceholder": "Enter your name",
    "yourEmail": "Your Email:",
    "yourEmailPlaceholder": "Enter your email",
    "yourMessage": "Message:",
    "yourMessagePlaceholder": "Write your message...",
    "sendMessage": "Send",
    "hello": "Hello, I am Kasia",
    "programming": "A great programming enthusiast for 2 years. Have graduated from the GOiT Academy, where I acquired a wide range of Frontend and Backend skills. You can see it <a href='./skills.html'>here</a>.",
    "here": "here.",
    "portfolio": "I have several projects in my portfolio, both individual and group. <a href='./projects.html'>Here</a> you will find links to pages and code.",
    "anotherInterests": "On a daily basis, I deal not only with programming. I have several other interests that I devote my free time to. If you want to learn more about me, please visit this <a href='./interests.html'>tab</a>",
    "tab": "tab.",
    "areYouInterested": "Do you like my website? Projects? Are you interested in cooperation? Please, <a href='./contact.html'>contact</a> me.",
    "allRights": "&copy; 2025 [Katarzyna]. All rights reserved.",
    "started": "I have been interested in programming for two years. I have completed almost a year programming course, and I have a Fullstack Developer certificate. During my studies I gained practical knowledge of Frontend and Backend.",
    "mySkills": "My Skills:",
    "html": "Markup language. Builds the skeleton of the website.",
    "css": "The language of styles. It allows for the positioning and appearance of individual elements of the website/application",
    "javascript": "Programming language. It allows you to interact with individual elements of the page.",
    "react": "Javascript library. It is used to build web applications.",
    "redux": "Javascript library. It is used to manage the state of the application. It's used most often with React, but can be used with another frameworks/libraries.",
    "node": "Javascript runtime. It allows you to execute code outside the browser (on the server), and create server applications/scripts/tools.",
    "mongoDb": "NoSQL database. It is characterized by high efficiency, scalability and flexibility, which allows you to build modern web, mobile and analytical applications.",
    "npm": "Node Package Manager. It is a package manager for Node.js. It allows you to install, manage and share Javascript packages that can be used in your projects.",
    "git": "Version control system. It allows you to track and manage changes to the source code. It is mainly used for working on team projects and managing the history of code changes.",
    "oop": "Object-Oriented Programming. It organizes the program around objects (class instances), which allows code reuse, extension and maintenance.",
    "rwd": "Responsive Web Design.  It allows you to adjust and correctly display a page or application on various devices and resolutions.",
    "projectIntroduction": "Here you can find some of my projects I have been working on. Certainly, this is not the end, and new ones will appear over the time..",
    "details": "Check the project details!",
    "technologiesUsed": "Technologies used:",
    "codeLink": "<a href=\"https://github.com/KasiaKaz14/goit-js-hw-11\">Link to code</a>",
    "nexinoWebsite": "Nexino Labs website",
    "website": "<a href=\"https://nexino-lab.netlify.app\">Website</a>",
    "programmingServices": "Programming services",
    "calendar": "Calendar",
    "calendarLink": "<a href=\"https://kasiakaz14.github.io/Calendar-scheduler\">Calendar</a>",
    "phonebook": "Phonebook",
    "phonebookLink": "<a href=\"https://kasiakaz14.github.io/goit-react-hw-08-phonebook\">Phonebook</a>",
    "imgFinder": "Image finder - React",
    "imgFinderLink": "<ahref=\"https://kasiakaz14.github.io/goit-react-hw-03-image-finder\">Image Finder - React</a>",
    "filmSuggestions": "Suggestions for the latest movies",
    "movies": "<a href=\"https://kasiakaz14.github.io/goit-react-hw-05-movies\">Movies</a>",
    "imgFinderJs": "Image Finder - JavaScript",
    "imgFinderJsLink": "<a href=\"https://kasiakaz14.github.io/goit-js-hw-11\">Image finder - JavaScript</a>",
    "interestInfo": "My passion is not only programming, but also sports, books, and foreign languages.",
    "football": "Football",
    "footballDetails": "It has been my love basically since I learnt to walk. I was always a very active child who spent all day outside chasing a ball.\nAs an older girl, I took part in sports competitions many times, and currently I am a player in a second-league team, where I play as a winger/swinger.\nI train twice a week at the club, and also 3-4 times individually.\nThis round object has been with me for about 25 years and counting! ;)",
    "books": "Books",
    "booksDetails": "Another element I can't imagine my daily life without. I read for about half an hour a day on average. I'm a huge fan of crime novels, but I also enjoy reading sports biographies or books related to Slavic mythology, including novels. My favorite crime authors are Katarzyna Puzyńska, Wojciech Chmielarz, and Remigiusz Mróz, although I also really enjoy the Jack Reacher series by Lee Child.I couldn't fail to mention Anna Kańtoch, who weaves elements of fantasy and mysteries from the past into her books. Her works are truly unputdownable.",
    "foreignLanguages": "Foreign languages",
    "foreignLanguagesDetails": "It's a topic that has always fascinated me. In school, I had the opportunity to learn English and Russian, which I now speak at C1 and B1 levels, respectively. I've also always dreamed of learning German, so I try to pick up new phrases from time to time.I can proudly say that I already understand a bit! :)"
  }
}
